[
  {
    "id": "1",
    "name": "The Shawshank Redemption",
    "releaseYear": 1994,
    "description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.",
    "longDesc": "The Shawshank Redemption is a 1994 American drama film written and directed by Frank Darabont, based on the 1982 Stephen King novella Rita Hayworth and Shawshank Redemption. It tells the story of banker Andy Dufresne (Tim Robbins), who is sentenced to life in Shawshank State Penitentiary for the murders of his wife and her lover, despite his claims of innocence. Over the following two decades, he befriends a fellow prisoner, contraband smuggler Ellis 'Red' Redding (Morgan Freeman), and becomes instrumental in a money-laundering operation led by the prison warden Samuel Norton (Bob Gunton). William Sadler, Clancy Brown, Gil Bellows, and James Whitmore appear in supporting roles. Darabont purchased the film rights to King's story in 1987, but development did not begin until five years later, when he wrote the script over an eight-week period. Two weeks after submitting his script to Castle Rock Entertainment, Darabont secured a $25 million budget to produce The Shawshank Redemption, which started pre-production in January 1993. While the film is set in Maine, principal photography took place from June to August 1993 almost entirely in Mansfield, Ohio, with the Ohio State Reformatory serving as the eponymous penitentiary. The project attracted many stars of the time for the role of Andy, including Tom Hanks, Tom Cruise, and Kevin Costner. Thomas Newman provided the film's score. While The Shawshank Redemption received positive reviews on its release, particularly for its story and the performances of Robbins and Freeman, it was a box-office disappointment, earning only $16 million during its initial theatrical run. Many reasons were cited for its failure at the time, including competition from films such as Pulp Fiction and Forrest Gump, to the general unpopularity of prison films, lack of female characters, and even the title, which was considered to be confusing for audiences. It went on to receive multiple award nominations, including seven Academy Award nominations, and a theatrical re-release that, combined with international takings, increased the film's box-office gross to $58.3 million. Over 320,000 VHS copies were shipped throughout the United States, and on the strength of its award nominations and word of mouth, it became one of the top rented films of 1995. The broadcast rights were acquired following the purchase of Castle Rock by Turner Broadcasting System, and it was shown regularly on the TNT network starting in 1997, further increasing its popularity. It is now considered by many to be one of the greatest films of the 1990s. Decades after its release, the film was still broadcast regularly, and is popular in several countries, with audience members and celebrities citing it as a source of inspiration, and naming the film as a favorite in various surveys. In 2015, the United States Library of Congress selected the film for preservation in the National Film Registry, finding it 'culturally, historically, or aesthetically significant'.",
    "rating": 4.8,
    "genre": "historical",
    "image": "https://m.media-amazon.com/images/M/MV5BNjQ2NDA3MDcxMF5BMl5BanBnXkFtZTgwMjE5NTU0NzE@._V1_CR0,60,640,360_AL_UX477_CR0,0,477,268_AL_.jpg",
    "cover": "https://mediad.publicbroadcasting.net/p/wcbe/files/styles/x_large/public/202004/shaw_2.jpg"
  },
  {
    "id": "2",
    "name": "The Dark Knight",
    "releaseYear": 2008,
    "description": "When the menace known as The Joker emerges from his mysterious past, he wreaks havoc and chaos on the people of Gotham. The Dark Knight must accept one of the greatest psychological and physical tests of his ability to fight injustice.",
    "longDesc": "The Dark Knight is a 2008 superhero film directed, produced, and co-written by Christopher Nolan. Based on the DC Comics character Batman, the film is the second installment of Nolan's The Dark Knight Trilogy and a sequel to 2005's Batman Begins, starring Christian Bale and supported by Michael Caine, Heath Ledger, Gary Oldman, Aaron Eckhart, Maggie Gyllenhaal, and Morgan Freeman. In the film, Bruce Wayne / Batman (Bale), Police Lieutenant James Gordon (Oldman) and District Attorney Harvey Dent (Eckhart) form an alliance to dismantle organized crime in Gotham City, but are menaced by an anarchistic mastermind known as the Joker (Ledger), who seeks to undermine Batman's influence and throw the city into anarchy. Nolan's inspiration for the film was the Joker's comic book debut in 1940, the 1988 graphic novel The Killing Joke, and the 1996 series The Long Halloween, which retold Harvey Dent's origin. The 'Dark Knight' nickname was first applied to Batman in Batman #1 (1940), in a story written by Bill Finger.[4][5] The Dark Knight was filmed primarily in Chicago, as well as in several other locations in the United States, the United Kingdom, and Hong Kong. The film was the first mainstream feature to partially utilize IMAX 70 mm cameras, with Nolan using them for 28 minutes of the film, including the Joker's first appearance. Warner Bros. initially created a viral marketing campaign for The Dark Knight, developing promotional websites and trailers highlighting screenshots of Ledger as the Joker. Ledger died on January 22, 2008, some months after he completed filming and six months before the film's release from a toxic combination of prescription drugs, leading to intense attention from the press and movie-going public. Upon its release on July 18, 2008, The Dark Knight achieved significant critical and commercial success. With over $1 billion in revenue worldwide, it became the highest-grossing film of 2008 and the fourth-highest-grossing film at the time of its release; it also set the record for highest-grossing domestic opening with $158 million, a record it held for three years.[6][7] At the 81st Academy Awards, the film received eight nominations; it won the award for Best Sound Editing and Ledger was posthumously awarded Best Supporting Actor.[8] The Dark Knight is considered one of the best films of its decade and one of the best superhero films ever made. The Dark Knight Rises, the final film in the trilogy, was released on July 20, 2012.",
    "rating": 4.7,
    "genre": "action, crime, drama",
    "image": "https://img.cinemablend.com/filter:scale/quill/c/3/8/0/f/4/c380f4f12cfeec19f0c40c6f57db188f2f98cca8.jpg?mw=600",
    "cover": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/wire/legacy/Batman-The-Dark-Knight-Wallpapers.jpg"
  },
  {
    "id": "3",
    "name": "Lord of the Rings",
    "releaseYear": 2004,
    "description": "A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.",
    "longDesc": "The Lord of the Rings: The Fellowship of the Ring is a 2001 epic fantasy adventure film directed by Peter Jackson, based on the first volume of J. R. R. Tolkien's The Lord of the Rings. The film is the first instalment in The Lord of the Rings trilogy. It was produced by Barrie M. Osborne, Jackson, Fran Walsh and Tim Sanders, and written by Walsh, Philippa Boyens and Jackson. The film features an ensemble cast including Elijah Wood, Ian McKellen, Liv Tyler, Viggo Mortensen, Sean Astin, Cate Blanchett, John Rhys-Davies, Billy Boyd, Dominic Monaghan, Orlando Bloom, Christopher Lee, Hugo Weaving, Sean Bean, Ian Holm, and Andy Serkis. It is followed by The Two Towers (2002) and The Return of the King (2003). Set in Middle-earth, the story tells of the Dark Lord Sauron, who seeks the One Ring. The Ring has found its way to the young hobbit Frodo Baggins. The fate of Middle-earth hangs in the balance as Frodo and eight companions (who form the Fellowship of the Ring) begin their journey to Mount Doom in the land of Mordor, the only place where the Ring can be destroyed. The Fellowship of the Ring was financed and distributed by American studio New Line Cinema, but filmed and edited entirely in Jackson's native New Zealand, concurrently with the other two parts of the trilogy. It premiered on 10 December 2001 at the Odeon Leicester Square in London and was theatrically released on 19 December 2001 in the United States, and on 20 December 2001 in New Zealand. The film was highly acclaimed by critics and fans alike, who considered it to be a landmark in filmmaking and an achievement in the fantasy film genre. It grossed $887.8 million worldwide, making it the second highest-grossing film of 2001 and the fifth highest-grossing film of all time at the time of its release.[5] The Fellowship of the Ring is widely regarded as one of the greatest and most influential films ever made. The film received numerous accolades; at the 74th Academy Awards, it was nominated for thirteen awards, including Best Picture, Best Director, Best Adapted Screenplay, Best Supporting Actor for McKellen, Best Art Direction, Best Costume Design, Best Film Editing, Best Original Song for 'May It Be' and Best Sound, winning four: Best Cinematography, Best Makeup, Best Original Score and Best Visual Effects.",
    "rating": 4.9,
    "genre": "adventure, drama, fantasy",
    "image": "https://img.cinemablend.com/filter:scale/quill/0/f/5/2/a/6/0f52a6843a25c1a5c1f9a0c00548cad9e1d912e2.jpg?mw=600",
    "cover": "https://am22.mediaite.com/tms/cnt/uploads/2020/04/lord-of-the-rings-fellowship-of-the-ring.jpg"
  },
  {
    "name": "Testing movie",
    "description": "Testing movie desc",
    "rating": "",
    "image": "https://images.unsplash.com/photo-1597649260852-86b26272e472?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1225&q=80",
    "cover": "https://images.unsplash.com/photo-1597649260852-86b26272e472?ixlib=rb-1.2.1&ixid=eyJhcHBfaWQiOjEyMDd9&auto=format&fit=crop&w=1225&q=80",
    "longDesc": "Testing movie long desc",
    "genre": "adventure",
    "id": "bdb8xoc"
  }
]